; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v8 ?v6)
             (pred_9 ?v12 ?v11)
             (pred_3 ?v8 ?v11)
             (pred_2 ?v2 ?v8 )
	     (pred_6 ?v8)
             (pred_4 ?v13)
             (pred_11 ?v12)
             (pred_5 ?v11)
             (pred_10 ?v8)
             (pred_12 ?v12)
             (pred_1 ?v8)
             (pred_7 ))



(:action op_3
:parameters (?v3 ?v7 ?v10 ?v1)
:precondition (and (pred_4 ?v3) (pred_4 ?v7) (pred_11 ?v10) (pred_5 ?v1)
          (pred_8 ?v3 ?v7) (pred_9 ?v10 ?v1)
                   (pred_3 ?v7 ?v1) (pred_6 ?v3) 
                   (pred_10 ?v7) (pred_12 ?v10))
:effect (and  (pred_1 ?v7) (not (pred_10 ?v7))))


(:action op_1
:parameters (?v3 ?v4)
:precondition (and (pred_4 ?v3) (pred_4 ?v4)
               (pred_6 ?v3) (pred_8 ?v3 ?v4) (pred_1 ?v4))
:effect (and (pred_6 ?v4) (not (pred_6 ?v3))))

(:action op_4
:parameters (?v3 ?v10)
:precondition (and (pred_4 ?v3) (pred_11 ?v10) 
                  (pred_6 ?v3) (pred_2 ?v10 ?v3) (pred_7 ))
:effect (and (pred_12 ?v10)
   (not (pred_2 ?v10 ?v3)) (not (pred_7 ))))


(:action op_5
:parameters (?v3 ?v5 ?v9)
:precondition (and (pred_4 ?v3) (pred_11 ?v5) (pred_11 ?v9)
                  (pred_6 ?v3) (pred_12 ?v9) (pred_2 ?v5 ?v3))
:effect (and (pred_12 ?v5) (pred_2 ?v9 ?v3)
        (not (pred_12 ?v9)) (not (pred_2 ?v5 ?v3))))

(:action op_2
:parameters (?v3 ?v10)
:precondition (and (pred_4 ?v3) (pred_11 ?v10) 
                  (pred_6 ?v3) (pred_12 ?v10))
:effect (and (pred_7 ) (pred_2 ?v10 ?v3) (not (pred_12 ?v10)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_12 obj_03 obj_06 obj_04 obj_10 obj_21 obj_14 obj_13 obj_20 obj_17 obj_22 obj_08 obj_18 obj_19 obj_02
    obj_15 obj_09 obj_01
    obj_07 obj_16 obj_05
    )

    (:init
       (pred_7)

       (pred_4 obj_11)
       (pred_4 obj_12)
       (pred_4 obj_03)
       (pred_4 obj_06)
       (pred_4 obj_04)
       (pred_4 obj_10)
       (pred_4 obj_21)
       (pred_4 obj_14)
       (pred_4 obj_13)
       (pred_4 obj_20)
       (pred_4 obj_17)
       (pred_4 obj_22)
       (pred_4 obj_08)
       (pred_4 obj_18)
       (pred_4 obj_19)
       (pred_4 obj_02)
       (pred_5 obj_15)
       (pred_5 obj_09)
       (pred_5 obj_01)
       (pred_11 obj_07)
       (pred_11 obj_16)
       (pred_11 obj_05)

       (pred_8 obj_11 obj_04)
       (pred_8 obj_11 obj_12)
       (pred_8 obj_12 obj_10)
       (pred_8 obj_12 obj_03)
       (pred_8 obj_12 obj_11)
       (pred_8 obj_03 obj_21)
       (pred_8 obj_03 obj_06)
       (pred_8 obj_03 obj_12)
       (pred_8 obj_06 obj_14)
       (pred_8 obj_06 obj_03)
       (pred_8 obj_04 obj_13)
       (pred_8 obj_04 obj_10)
       (pred_8 obj_04 obj_11)
       (pred_8 obj_10 obj_20)
       (pred_8 obj_10 obj_21)
       (pred_8 obj_10 obj_12)
       (pred_8 obj_10 obj_04)
       (pred_8 obj_21 obj_17)
       (pred_8 obj_21 obj_14)
       (pred_8 obj_21 obj_03)
       (pred_8 obj_21 obj_10)
       (pred_8 obj_14 obj_22)
       (pred_8 obj_14 obj_06)
       (pred_8 obj_14 obj_21)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_13 obj_20)
       (pred_8 obj_13 obj_04)
       (pred_8 obj_20 obj_18)
       (pred_8 obj_20 obj_17)
       (pred_8 obj_20 obj_10)
       (pred_8 obj_20 obj_13)
       (pred_8 obj_17 obj_19)
       (pred_8 obj_17 obj_22)
       (pred_8 obj_17 obj_21)
       (pred_8 obj_17 obj_20)
       (pred_8 obj_22 obj_02)
       (pred_8 obj_22 obj_14)
       (pred_8 obj_22 obj_17)
       (pred_8 obj_08 obj_18)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_18 obj_19)
       (pred_8 obj_18 obj_20)
       (pred_8 obj_18 obj_08)
       (pred_8 obj_19 obj_02)
       (pred_8 obj_19 obj_17)
       (pred_8 obj_19 obj_18)
       (pred_8 obj_02 obj_22)
       (pred_8 obj_02 obj_19)
       (pred_10 obj_08)
       (pred_10 obj_10)
       (pred_10 obj_06)
       (pred_3  obj_08 obj_15)
       (pred_3  obj_10 obj_09)
       (pred_3  obj_06 obj_01)
       (pred_1 obj_11)
       (pred_1 obj_12)
       (pred_1 obj_03)
       (pred_1 obj_04)
       (pred_1 obj_21)
       (pred_1 obj_14)
       (pred_1 obj_13)
       (pred_1 obj_20)
       (pred_1 obj_17)
       (pred_1 obj_22)
       (pred_1 obj_18)
       (pred_1 obj_19)
       (pred_1 obj_02)

       (pred_9  obj_07 obj_15)
       (pred_9  obj_16 obj_09)
       (pred_9  obj_05 obj_01)
       (pred_2 obj_07 obj_20)
       (pred_2 obj_16 obj_13)
       (pred_2 obj_05 obj_04)
       (pred_6 obj_11)
    )

    (:goal (and
       (pred_2 obj_16 obj_21)
       (pred_2 obj_05 obj_18)
    ))
(:constraints
  (always (not (pred_6 obj_17)))
)
)

; plan
1. (op_1 obj_11 obj_04)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_04)
   goals met: 0 of 2
2. (op_1 obj_04 obj_13)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_13)
   goals met: 0 of 2
3. (op_4 obj_13 obj_16)
   deleted: (pred_2 obj_16 obj_13) (pred_7)
   added: (pred_12 obj_16)
   goals met: 0 of 2
4. (op_1 obj_13 obj_04)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_04)
   goals met: 0 of 2
5. (op_3 obj_04 obj_10 obj_16 obj_09)
   deleted: (pred_10 obj_10)
   added: (pred_1 obj_10)
   goals met: 0 of 2
6. (op_1 obj_04 obj_10)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_10)
   goals met: 0 of 2
7. (op_1 obj_10 obj_21)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_21)
   goals met: 0 of 2
8. (op_2 obj_21 obj_16)
   deleted: (pred_12 obj_16)
   added: (pred_7) (pred_2 obj_16 obj_21)
   goals met: 1 of 2
9. (op_1 obj_21 obj_10)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_10)
   goals met: 1 of 2
10. (op_1 obj_10 obj_04)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_04)
   goals met: 1 of 2
11. (op_4 obj_04 obj_05)
   deleted: (pred_2 obj_05 obj_04) (pred_7)
   added: (pred_12 obj_05)
   goals met: 1 of 2
12. (op_1 obj_04 obj_10)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_10)
   goals met: 1 of 2
13. (op_1 obj_10 obj_20)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_20)
   goals met: 1 of 2
14. (op_1 obj_20 obj_18)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_18)
   goals met: 1 of 2
15. (op_2 obj_18 obj_05)
   deleted: (pred_12 obj_05)
   added: (pred_7) (pred_2 obj_05 obj_18)
   goals met: 2 of 2
